Importando as bases e convertendo

In [1]:
import pandas as pd
import numpy as np

df=pd.read_csv(
    r'C:\Users\blc\Google Drive\Esquema - planejamento\b.csv', 
    sep =';', 
    encoding = 'latin', 
    decimal=',', 
    thousands='.')

df2=pd.read_csv(
    r'C:\Users\blc\Google Drive\Esquema - planejamento\lab.csv', 
    sep =';', 
    encoding = 'latin', 
    decimal=',', 
    thousands='.')

Anlisar a qualidade geral dos dados

In [2]:
df.info()
print(
    '='*80
)
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1109 entries, 0 to 1108
Data columns (total 15 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Código da Engenharia        1109 non-null   int64
 1   Faturamento Médio           1109 non-null   int64
 2   Quantidade em Estoque       1109 non-null   float64
 3   Ordem de Fabricação Aberto  1109 non-null   float64
 4   Comprometido                1109 non-null   float64
 5   Disponível                  1109 non-null   float64
 6   Estoque Mínimo              1109 non-null   float64
 7   Balanço                     1109 non-null   float64
 8   Prazo Produção              0 non-null      float64
 9   Máscara                     1109 non-null   int64
 10  Unidade de Medida           1109 non-null   object
 11  Peso Unitário               1109 non-null   float64
 12  Peso Total                  1109 non-null   float64
 13  Lote!Econômico              1109 non-null   int64
 14  Lote de!Produção            1109 non-null   float64
dtypes: float64(10), int64(4), object(1)
memory usage: 130.1+ KB
================================================================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14099 entries, 0 to 14098
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Código Engenharia  14099 non-null  object
 1   Código Produto     14099 non-null  int64
 2   Status             14099 non-null  object
 3   Centro Custo       14099 non-null  object
dtypes: int64(1), object(3)
memory usage: 440.7+ KB

Visualizar os dados de forma resumida

In [3]:
df.head()

,Código da Engenharia,Faturamento Médio,Quantidade em Estoque,Ordem de Fabricação Aberto,Comprometido,Disponível,Estoque Mínimo,Balanço,Prazo Produção,Máscara,Unidade de Medida,Peso Unitário,Peso Total,Lote!Econômico,Lote de!Produção
0,3,0,0.0,0.0,0.0,0.0,300.0,-300.0,NaN,1010218,kg,1.0,300.0,0,300.0
1,4,0,160.0,0.0,0.0,160.0,200.0,-40.0,NaN,1010212,kg,1.0,40.0,0,300.0
2,5,0,192.0,0.0,60.0,132.0,0.0,132.0,NaN,1224008,kg,1.0,132.0,0,120.0
3,6,0,0.0,0.0,0.0,0.0,300.0,-300.0,NaN,1010201,kg,1.0,300.0,0,300.0
4,8,0,742.5,0.0,12.5,730.0,600.0,130.0,NaN,1010202,kg,1.0,130.0,0,300.0

In [4]:
df2.head()

,Código Engenharia,Código Produto,Status,Centro Custo
0,000000001-0,1,Inativo,1.2.001 - Laboratorio Pastas Lisas
1,000000001-0,1,Inativo,1.2.001 - Laboratorio Pastas Lisas
2,000000001-0,1,Inativo,1.2.001 - Laboratorio Pastas Lisas
3,000000001-0,1,Inativo,1.2.001 - Laboratorio Pastas Lisas
4,000000001-0,1,Inativo,1.2.001 - Laboratorio Pastas Lisas

Análise descritiva dos dados da 'df

In [5]:
df.describe().round(2)

,Código da Engenharia,Faturamento Médio,Quantidade em Estoque,Ordem de Fabricação Aberto,Comprometido,Disponível,Estoque Mínimo,Balanço,Prazo Produção,Máscara,Peso Unitário,Peso Total,Lote!Econômico,Lote de!Produção
count,1109.00,1109.0,1109.00,1109.00,1109.00,1109.00,1109.00,1109.00,0.0,1109.00,1109.00,1109.00,1109.0,1109.00
mean,1112.32,0.0,459.75,1179.71,486.33,1153.12,332.30,820.82,NaN,1464752.13,15.02,82.85,0.0,102.28
std,794.60,0.0,1420.36,5039.77,2990.90,3495.19,2474.22,2747.32,NaN,851491.18,414.73,177.63,0.0,188.68
min,3.00,0.0,0.00,0.00,0.00,-569.40,0.00,-26856.00,NaN,1010201.00,0.00,0.00,0.0,0.00
25%,442.00,0.0,0.00,0.00,0.00,0.00,0.00,0.00,NaN,1049943.00,1.00,0.00,0.0,0.00
50%,861.00,0.0,7.40,0.00,0.00,8.00,0.00,0.00,NaN,1119904.00,1.00,3.52,0.0,0.00
75%,1898.00,0.0,260.40,300.00,36.00,525.00,65.00,320.00,NaN,2011130.00,1.00,54.00,0.0,120.00
max,6000.00,0.0,17122.00,76770.00,45472.00,43750.00,65004.00,32484.00,NaN,9999999.00,13737.00,957.00,0.0,1201.20

# inicia tratamento da df

Remover colunas desnecessárias:

In [6]:
df.drop(
    ['Faturamento Médio',
    'Ordem de Fabricação Aberto',
    'Disponível', 
     'Estoque Mínimo',
    'Balanço', 
     'Prazo Produção',
    'Máscara', 
     'Unidade de Medida',
    'Peso Unitário', 
    'Peso Total', 
    'Lote!Econômico', 
    'Lote de!Produção'],
    axis=1, inplace=True)

Renomear as colunas que utilizarei

In [7]:
df.rename(
    columns={
        'Código da Engenharia':'CodProd',
        'Quantidade em Estoque':'Estoq',
        'Comprometido':'Order'},
          inplace=True
)

conferir se os nomes estão ok

In [8]:
df.columns

Index(['CodProd', 'Estoq', 'Order'], dtype='object')

Atualiza visualização

In [9]:
df.head()

   CodProd  Estoq  Order
0        3    0.0    0.0
1        4  160.0    0.0
2        5  192.0   60.0
3        6    0.0    0.0
4        8  742.5   12.5

Adiciona coluna de resultado da subtração

In [10]:
df['saldo']= df['Estoq']-df['Order']
df.head()

   CodProd  Estoq  Order  saldo
0        3    0.0    0.0    0.0
1        4  160.0    0.0  160.0
2        5  192.0   60.0  132.0
3        6    0.0    0.0    0.0
4        8  742.5   12.5  730.0

ordenando os dados da coluna saldo

In [11]:
#df.sort_values('saldo',ascending=True)

df.sort_values('saldo')

     CodProd    Estoq    Order    saldo
581      909   8064.0  44254.0 -36190.0
728     1475   1084.0  34104.0 -33020.0
654     1128  15134.0  45472.0 -30338.0
582      910  17122.0  44828.0 -27706.0
609      972   2506.0  23646.0 -21140.0
..       ...      ...      ...      ...
748     1511   5792.0      4.0   5788.0
737     1491   7732.0   1528.0   6204.0
271      435   6548.0      0.0   6548.0
521      811   8372.0      0.0   8372.0
330      520   8784.0      0.0   8784.0

[1109 rows x 4 columns]

In [12]:
tb = df.sort_values('saldo')

In [13]:
tb.round()

     CodProd    Estoq    Order    saldo
581      909   8064.0  44254.0 -36190.0
728     1475   1084.0  34104.0 -33020.0
654     1128  15134.0  45472.0 -30338.0
582      910  17122.0  44828.0 -27706.0
609      972   2506.0  23646.0 -21140.0
..       ...      ...      ...      ...
748     1511   5792.0      4.0   5788.0
737     1491   7732.0   1528.0   6204.0
271      435   6548.0      0.0   6548.0
521      811   8372.0      0.0   8372.0
330      520   8784.0      0.0   8784.0

[1109 rows x 4 columns]

# Finaliza tratamento da df e inicia tratamento da df1

identifica as colunas

In [14]:
df2.columns

Index(['Código Engenharia', 'Código Produto', 'Status', 'Centro Custo'], dtype='object')

Remove colunas desnecessárias

In [15]:
df2.drop(
    ['Código Engenharia',
        'Status'], 
    axis=1, 
    inplace=True
)

Confere as colunas disponíveis

In [16]:
df2.head()

   Código Produto                        Centro Custo
0               1  1.2.001 - Laboratorio Pastas Lisas
1               1  1.2.001 - Laboratorio Pastas Lisas
2               1  1.2.001 - Laboratorio Pastas Lisas
3               1  1.2.001 - Laboratorio Pastas Lisas
4               1  1.2.001 - Laboratorio Pastas Lisas

Renomear colunas

In [17]:
df2.rename(
    columns={
        'Centro Custo':'Lab',
        'Código Produto':'CodProd'
    },
    inplace=True
)

Confere os nomes

In [18]:
df2.columns

Index(['CodProd', 'Lab'], dtype='object')

Remover duplicatas

In [19]:
df2.drop_duplicates(subset=['CodProd'],inplace=True)

Confere se os tipos das colunas estão iguais

In [20]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1259 entries, 0 to 14088
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CodProd  1259 non-null   int64
 1   Lab      1259 non-null   object
dtypes: int64(1), object(1)
memory usage: 29.5+ KB

In [21]:
tb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1109 entries, 581 to 330
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CodProd  1109 non-null   int64
 1   Estoq    1109 non-null   float64
 2   Order    1109 non-null   float64
 3   saldo    1109 non-null   float64
dtypes: float64(3), int64(1)
memory usage: 43.3 KB

Confere se a coluna 'Cod' da df pode ser a chave primária, linha 1 conta os distintos e linha 2 conta o total (devem ser iguais)

In [22]:
distintos = tb['CodProd'].nunique()
total = tb.shape[0] # o zero significa linhas, para colunas digitar 1

if distintos == total:
    print('='*40,'\nchave primária ok','\n',distintos,'\n',total)
else:    
    print('='*40,'\nIdentificar chave primária!','\n',distintos,'\n',total)

========================================
chave primária ok
 1109
 1109

Incia o merge entre df

In [23]:
mtable=pd.merge(
    tb,df2,
    left_on='CodProd',
    right_on='CodProd', 
    how='inner',
    indicator=True)
mtable.columns

Index(['CodProd', 'Estoq', 'Order', 'saldo', 'Lab', '_merge'], dtype='object')

Confere se a qtde de linhas está a mesma

In [24]:
mt=mtable.shape[0]
print(' ',mt,'\n ',total,'\n','a diferença é de:',total-mt)

  721
  1109
 a diferença é de: 388

In [25]:
mtable.head()

,CodProd,Estoq,Order,saldo,Lab,_merge
0,909,8064.0,44254.0,-36190.0,1.2.002 - Laboratorio Pastas Oleosas,both
1,1475,1084.0,34104.0,-33020.0,1.2.002 - Laboratorio Pastas Oleosas,both
2,1128,15134.0,45472.0,-30338.0,1.2.002 - Laboratorio Pastas Oleosas,both
3,910,17122.0,44828.0,-27706.0,1.2.002 - Laboratorio Pastas Oleosas,both
4,972,2506.0,23646.0,-21140.0,1.2.002 - Laboratorio Pastas Oleosas,both

Conferir resultado

In [26]:
mtable.describe().round(2)

       CodProd     Estoq     Order     saldo
count   721.00    721.00    721.00    721.00
mean    790.94    707.15    748.05    -40.90
std     599.72   1711.55   3683.75   2851.14
min       3.00      0.00      0.00 -36190.00
25%     381.00      8.60      0.00      0.00
50%     646.00    102.90      4.20     18.80
75%    1010.00    552.00    146.40    265.00
max    3014.00  17122.00  45472.00   8784.00

colorindo de vermelho o resultado negativo

In [37]:
def neg(number):
    color = 'red' if number < 0 else 'black'
    return f'color: {color}'

In [38]:
#mtable.style.applymap(neg,subset=['saldo'])
#mtable.round({'Estoq': 0, 'Order': 0,'saldo': 0})
#s.round(['Estoq', 'Order', 'saldo'])

exporta resultado para excel

In [33]:
mtable.to_excel(r'C:\Users\blc\Google Drive\Esquema - planejamento\ordes.xlsx', sheet_name='saldo', index = False)